brew 'coreutils'
brew 'findutils'
brew 'git'
brew 'graphviz'
brew 'httpie'
brew 'imagemagick'
brew 'jq'
brew 'mas'
brew 'pandoc'
brew 'thefuck'
brew 'trash'
brew 'wget'

cask '1password'
cask '1password-cli'
cask 'basictex'
cask 'discord'
cask 'displaylink'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'hammerspoon'
cask 'httpie'
cask 'hyper'
cask 'kap'
# cask 'kindle'
cask 'microsoft-edge'
cask 'microsoft-teams'
# cask 'mirrorop'
cask 'monitorcontrol'
cask 'mysides'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-json'
cask 'quicklookase'
cask 'raycast'
# cask 'rectangle'
# cask 'skyfonts'
cask 'slack'
cask 'visual-studio-code'
cask 'webpquicklook'
# cask 'zoom'

mas 'Microsoft To Do', id: 1274495053

# TODO: Xcode is incredibly slow, find a way to run in background?
# mas 'Xcode', id: 497799835

# https://github.com/Homebrew/homebrew-cask/pull/75538
# Manualy download noted in system/install.sh
# cask 'citrix-workspace'
